DataProcessors/СравнениеХарактеристикКандидатов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<DataProcessor>
		<Properties>
			<Name>СравнениеХарактеристикКандидатов</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/НастройкаВопросовДляСобеседования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>НастройкаВопросовДляСобеседования</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Балл</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ЭлементарныйВопросВопросаДляСобеседования</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ВопросыДляАнкетирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветНаВопросВопросаДляСобеседования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВариантыОтветовАнкет</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Вакансии</v8:Type>
						<v8:Type>cfg:CatalogRef.ПрофилиДолжностей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВопросДляСобеседования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВопросыДляСобеседования</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЭлементарныйВопрос</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ВопросыДляАнкетирования</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОтветНаВопрос</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВариантыОтветовАнкет</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаПерсонала</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ХарактеристикиПерсонала</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗначениеХарактеристики</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗначенияХарактеристикПерсонала</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/АнкетыКандидатов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>АнкетыКандидатов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Анкета</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Анкета</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ЛичныеДанныеКандидата</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛичныеДанныеКандидатов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Вакансия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Вакансии</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЭтапРаботыСКандидатом</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЭтапыРаботыСКандидатами</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Кандидат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кандидаты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/МотиваторыВАнкетах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>МотиваторыВАнкетах</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Анкета</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Анкета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Мотиватор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Мотиваторы</v8:Type>
						<v8:Type>cfg:CatalogRef.Демотиваторы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/РаботаСКандидатами.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>РаботаСКандидатами</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЭтапРаботы</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЭтапРаботыСКандидатами</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СостояниеЭтапа</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияЭтаповРаботыСКандидатами</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ШаблонАнкеты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШаблоныАнкет</v8:Type>
						<v8:Type>cfg:CatalogRef.ЭлектронныеКурсы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПричинаОтклонения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПричиныОтклоненияКандидатов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПериодОкончание</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Бронь</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Бронь</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Организатор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УчетнаяЗаписьВидеоконференции</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УчетныеЗаписиВидеоконференций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИдентификаторВидеоконференции</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РешениеОПриемеНаРаботу</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриемНаРаботу</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриемНаРаботуСписком</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Кандидат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кандидаты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/СостоянияСогласования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>СостоянияСогласования</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Отклонено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Рассматривается</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Согласовано</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СостоянияЭтаповРаботыСКандидатами.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>СостоянияЭтаповРаботыСКандидатами</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Запланирован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Пройден</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Пропущен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ВопросыШаблонаАнкеты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>ВопросыШаблонаАнкеты</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.ШаблоныАнкет</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Формулировка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Обязательный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипВопроса</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыВопросовШаблонаАнкеты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипТабличногоВопроса</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыТабличныхВопросов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭлементарныйВопрос</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ВопросыДляАнкетирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РодительВопрос</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВопросыШаблонаАнкеты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заметки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подсказка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособОтображенияПодсказки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыОтображенияПодсказок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СоставТабличногоВопроса</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЭлементарныйВопрос</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ВопросыДляАнкетирования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПредопределенныеОтветы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЭлементарныйВопрос</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ВопросыДляАнкетирования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ответ</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВопросыДляАнкетирования</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СоставКомплексногоВопроса</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЭлементарныйВопрос</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ВопросыДляАнкетирования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

DataProcessors/СравнениеХарактеристикКандидатов/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Функция РезультатОтчета(Отбор) Экспорт
	
	ЛичныеДанныеКандидатов = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Отбор, "ЛичныеДанныеКандидатов");
	Если ЛичныеДанныеКандидатов = Неопределено Тогда
		ЛичныеДанныеКандидатов = ЛичныеДанныеКандидатов(КандидатыПоОтбору(Отбор));
	КонецЕсли;
	
	Возврат ДанныеОтчета(Отбор.Вакансия, ЛичныеДанныеКандидатов, 
		ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Отбор, "Характеристики"));
	
КонецФункции

// Получает данные для формирования отчета по сравнению характеристик кандидатов.
//
// Параметры:
//  Вакансия	 - СправочникСсылка.Вакансии - вакансия, для которой формируется отчет.
//  ЛичныеДанныеКандидатов - Массив Из СправочникСсылка.ЛичныеДанныеКандидатов -
//   список отбираемых личных данных кандидатов.
//  Характеристики - Неопределено, Массив Из ПланВидовХарактеристикСсылка.ХарактеристикиПерсонала - список этапов
//      работы, по которым сравниваются характеристики.
// 
// Возвращаемое значение:
//   Структура - данные отчета.
//
Функция ДанныеОтчета(Вакансия, ЛичныеДанныеКандидатов, Характеристики = Неопределено)
	
	ДанныеОценок = ЭлектронноеИнтервью.ОценкиКандидатовПоХарактеристикам(Вакансия, 
		ЛичныеДанныеКандидатов, Характеристики, Характеристики <> Неопределено);
		
	ДанныеДетально = ДанныеОценок.Данные;
	УдалитьСтрокиСПустымиДаннымиКандидатов(ДанныеДетально);

	ДанныеСводно = ДанныеОценок.ТаблицаИтогов;
	УдалитьСтрокиСПустымиДаннымиКандидатов(ДанныеСводно);
	
	ОсновнаяТаблица = Новый ТаблицаЗначений;
	Для Каждого ОписаниеКолонки Из ГруппаОбщихКолонок() Цикл
		ОсновнаяТаблица.Колонки.Добавить(ОписаниеКолонки.Имя, ОписаниеКолонки.Тип);
	КонецЦикла;
	
	НомераКолонок = НоваяТаблицаНомераКолонок();
	
	ДанныеКандидатов = Справочники.Кандидаты.ДанныеКандидатов(
		КандидатыПоЛичнымДаннымКандидатов(ЛичныеДанныеКандидатов, Вакансия));
	ОбщегоНазначенияБЗК.ДобавитьИндексКоллекции(ДанныеКандидатов, "ЛичныеДанныеКандидата");
	
	Номер = 1;
	Для Каждого ТекущаяСтрока Из ДанныеСводно Цикл
		Для Каждого ОписаниеКолонки Из ГруппаКолонокНаКандидата() Цикл
			ОсновнаяТаблица.Колонки.Добавить(ИмяКолонки(ОписаниеКолонки.Имя, Номер), ОписаниеКолонки.Тип);
		КонецЦикла;
		НоваяСтрока = ДобавитьНомерКолонки(НомераКолонок, ТекущаяСтрока.ЛичныеДанныеКандидата, Номер);
		ДанныеКандидата = НайтиСтрокуТаблицы(ДанныеКандидатов, ТекущаяСтрока.ЛичныеДанныеКандидата,
			"ЛичныеДанныеКандидата");
		Если ДанныеКандидата <> Неопределено Тогда
			НоваяСтрока.Кандидат = ДанныеКандидата.Кандидат;
			НоваяСтрока.КандидатСостояние = ДанныеКандидата.Состояние;
		КонецЕсли;
		Номер = Номер + 1;
	КонецЦикла;
	ОбщегоНазначенияБЗК.ДобавитьИндексКоллекции(НомераКолонок, "ЛичныеДанныеКандидата");

	ПредставленияХарактеристик = ПредставленияХарактеристик(Вакансия);
	ОбщегоНазначенияБЗК.ДобавитьИндексКоллекции(ПредставленияХарактеристик, "Характеристика");

	ДанныеДетально.Сортировать("Характеристика, ЛичныеДанныеКандидата");
	Обход = Обработки.ОбходКоллекции.НовыйОбход(ДанныеДетально);
	Пока Обход.СледующийПоЗначениюПоля("Характеристика") Цикл
		НоваяСтрока = ОсновнаяТаблица.Добавить();
		НоваяСтрока.Характеристика = Обход.ТекущиеДанные()["Характеристика"];
		НайденныеСтроки = ПредставленияХарактеристик.НайтиСтроки(Новый Структура("Характеристика",
			НоваяСтрока.Характеристика));
		Если НайденныеСтроки.Количество() > 0 Тогда
			НоваяСтрока.ОсновноеЗначение = Обход.ТекущиеДанные()["ОсновноеЗначение"];
			НоваяСтрока.ЗначенияПредставление = НайденныеСтроки[0].ЗначенияСтрокой;
		КонецЕсли; 
		Пока Обход.СледующийПоЗначениюПоля("ЛичныеДанныеКандидата") Цикл
			Номер = НомерКолонкиЛичныеДанныеКандидата(НомераКолонок, Обход.ТекущиеДанные()["ЛичныеДанныеКандидата"]);
			НоваяСтрока[ИмяКолонки("Значение", Номер)] = Обход.ТекущиеДанные()["Значение"];
			НоваяСтрока[ИмяКолонки("Оценка", Номер)] = Обход.ТекущиеДанные()["Оценка"];
		КонецЦикла;
	КонецЦикла;
	
	ДанныеМотиваторов = ДанныеМотиваторов(Вакансия, ЛичныеДанныеКандидатов);
	ДанныеМотиваторов.Сортировать("ЛичныеДанныеКандидата, Количество Убыв");
		
	Структура = Новый Структура;
	Структура.Вставить("ОсновнаяТаблица", ОсновнаяТаблица);
	Структура.Вставить("ДанныеМотиваторов", ДанныеМотиваторов);
	Структура.Вставить("НомераКолонок", НомераКолонок);
	Структура.Вставить("ДанныеСводно", ДанныеСводно);
	Структура.Вставить("ЛичныеДанныеКандидатов", ЛичныеДанныеКандидатов);
	
	Возврат Структура;
	
КонецФункции

Функция ХарактеристикиДляОтбора(Вакансия, ЭтапыРаботыСКандидатами) Экспорт
	
	Если ЭтапыРаботыСКандидатами.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Вакансия", Вакансия);
	Запрос.УстановитьПараметр("ЭтапыРаботы", ЭтапыРаботыСКандидатами);
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Вакансии.Ссылка КАК Вакансия,
		|	ВЫБОР
		|		КОГДА Вакансии.СоответствуетПрофилюДолжности
		|			ТОГДА Вакансии.ПрофильДолжности
		|		ИНАЧЕ Вакансии.Ссылка
		|	КОНЕЦ КАК ВладелецВопросов,
		|	ЭтапыВакансии.ЭтапРаботы КАК ЭтапРаботы,
		|	ВопросыАнкеты.ЭлементарныйВопрос КАК ЭлементарныйВопрос
		|ПОМЕСТИТЬ ВТВопросыЭтапов
		|ИЗ
		|	Справочник.Вакансии КАК Вакансии
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Вакансии.ЭтапыРаботыСКандидатами КАК ЭтапыВакансии
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВопросыШаблонаАнкеты КАК ВопросыАнкеты
		|			ПО ЭтапыВакансии.ШаблонАнкеты = ВопросыАнкеты.Владелец
		|			И НЕ ВопросыАнкеты.ЭтоГруппа
		|			И НЕ ВопросыАнкеты.ПометкаУдаления
		|			И ВопросыАнкеты.ЭлементарныйВопрос <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВопросыДляАнкетирования.ПустаяСсылка)
		|		ПО Вакансии.Ссылка = ЭтапыВакансии.Ссылка
		|		И Вакансии.Ссылка = &Вакансия
		|		И ЭтапыВакансии.ЭтапРаботы В (&ЭтапыРаботы)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Вакансии.Ссылка,
		|	ВЫБОР
		|		КОГДА Вакансии.СоответствуетПрофилюДолжности
		|			ТОГДА Вакансии.ПрофильДолжности
		|		ИНАЧЕ Вакансии.Ссылка
		|	КОНЕЦ,
		|	ЭтапыВакансии.ЭтапРаботы,
		|	ВопросыКомплексногоВопроса.ЭлементарныйВопрос
		|ИЗ
		|	Справочник.Вакансии КАК Вакансии
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Вакансии.ЭтапыРаботыСКандидатами КАК ЭтапыВакансии
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВопросыШаблонаАнкеты.СоставКомплексногоВопроса КАК ВопросыКомплексногоВопроса
		|			ПО ЭтапыВакансии.ШаблонАнкеты = ВопросыКомплексногоВопроса.Ссылка.Владелец
		|			И НЕ ВопросыКомплексногоВопроса.Ссылка.ПометкаУдаления
		|			И
		|				ВопросыКомплексногоВопроса.ЭлементарныйВопрос <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВопросыДляАнкетирования.ПустаяСсылка)
		|		ПО Вакансии.Ссылка = &Вакансия
		|		И Вакансии.Ссылка = ЭтапыВакансии.Ссылка
		|		И ЭтапыВакансии.ЭтапРаботы В (&ЭтапыРаботы)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	НастройкаВопросовДляСобеседования.ХарактеристикаПерсонала КАК ХарактеристикаПерсонала
		|ИЗ
		|	ВТВопросыЭтапов КАК ВопросыЭтапов
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.НастройкаВопросовДляСобеседования КАК НастройкаВопросовДляСобеседования
		|		ПО ВопросыЭтапов.ВладелецВопросов = НастройкаВопросовДляСобеседования.Объект
		|		И ВопросыЭтапов.ЭлементарныйВопрос = НастройкаВопросовДляСобеседования.ЭлементарныйВопрос
		|		И
		|			НастройкаВопросовДляСобеседования.ХарактеристикаПерсонала <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.ХарактеристикиПерсонала.ПустаяСсылка)";
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ХарактеристикаПерсонала");

КонецФункции

Функция ПредставленияХарактеристик(Вакансия)

	ПредставленияХарактеристик = Новый ТаблицаЗначений;
	ПредставленияХарактеристик.Колонки.Добавить("Характеристика",
		Новый ОписаниеТипов("ПланВидовХарактеристикСсылка.ХарактеристикиПерсонала"));
	ПредставленияХарактеристик.Колонки.Добавить("ЗначенияСтрокой", Новый ОписаниеТипов("Строка"));

	ПараметрыПолучения = Справочники.Вакансии.ПараметрыПолученияДанныхВакансии();
	ПараметрыПолучения.ХарактеристикиПерсонала = Истина;
	ДанныеВакансии = Справочники.Вакансии.ДанныеВакансии(Вакансия, ПараметрыПолучения);
	
	Обход = Обработки.ОбходКоллекции.НовыйОбход(ДанныеВакансии.ХарактеристикиПерсонала);
	Пока Обход.СледующийПоЗначениюПоля("Характеристика") Цикл
		ЗначенияСтрокой = "";
		Пока Обход.Следующий() Цикл
			Если Не ПустаяСтрока(ЗначенияСтрокой) Тогда
				ЗначенияСтрокой = ЗначенияСтрокой + ", ";
			КонецЕсли;
			ЗначенияСтрокой = ЗначенияСтрокой + Обход.ТекущиеДанные()["Значение"];
		КонецЦикла;
		НоваяСтрока = ПредставленияХарактеристик.Добавить();
		НоваяСтрока.Характеристика = Обход.ТекущиеДанные()["Характеристика"];
		НоваяСтрока.ЗначенияСтрокой = ЗначенияСтрокой;
	КонецЦикла;
	
	Возврат ПредставленияХарактеристик;
	
КонецФункции

Функция ДанныеМотиваторов(Вакансия, ЛичныеДанныеКандидатов)

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Вакансия", Вакансия);
	Запрос.УстановитьПараметр("ЛичныеДанныеКандидатов", ЛичныеДанныеКандидатов);
	Запрос.Текст =
		"ВЫБРАТЬ
		|	АнкетыКандидатов.ЛичныеДанныеКандидата КАК ЛичныеДанныеКандидата,
		|	МотиваторыВАнкетах.Мотиватор КАК Мотиватор,
		|	СУММА(МотиваторыВАнкетах.Количество) КАК Количество
		|ИЗ
		|	РегистрСведений.АнкетыКандидатов КАК АнкетыКандидатов
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.МотиваторыВАнкетах КАК МотиваторыВАнкетах
		|		ПО АнкетыКандидатов.Анкета = МотиваторыВАнкетах.Анкета
		|ГДЕ
		|	АнкетыКандидатов.Вакансия = &Вакансия
		|	И АнкетыКандидатов.ЛичныеДанныеКандидата В (&ЛичныеДанныеКандидатов)
		|СГРУППИРОВАТЬ ПО
		|	АнкетыКандидатов.ЛичныеДанныеКандидата,
		|	МотиваторыВАнкетах.Мотиватор";
		
	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции

Процедура УдалитьСтрокиСПустымиДаннымиКандидатов(Таблица)
	
	Индекс = 0;
	Пока Индекс < Таблица.Количество() Цикл
		Если Не ЗначениеЗаполнено(Таблица[Индекс].ЛичныеДанныеКандидата) Тогда
			Таблица.Удалить(Индекс);
		Иначе
			Индекс = Индекс + 1;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#Область ПолучениеКандидатов

Функция КандидатыПоЛичнымДаннымКандидатов(ЛичныеДанныеКандидатов, Вакансия) Экспорт
	
	ТаблицаКандидатов = Справочники.Кандидаты.КандидатыПоЛичнымДаннымКандидатов(ЛичныеДанныеКандидатов);
	
	ОтборКандидатов = Новый Структура();
	ОтборКандидатов.Вставить("Ссылка", ТаблицаКандидатов.ВыгрузитьКолонку("Кандидат"));
	ОтборКандидатов.Вставить("Вакансия", Вакансия);
	
	Возврат Справочники.Кандидаты.КандидатыПоОтбору(ОтборКандидатов);
	
КонецФункции

Функция КандидатыПоОтбору(Отбор)

	ОтборКандидатов = Новый Соответствие;
	ОтборКандидатов.Вставить("Вакансия", Отбор.Вакансия);
	Если Отбор.Свойство("Кандидаты") Тогда
		ОтборКандидатов.Вставить("Ссылка", Отбор.Кандидаты);
	КонецЕсли;

	Если Отбор.ОтборВРаботе Тогда
		ОтборКандидатов.Вставить("Состояние", Перечисления.СостоянияСогласования.Рассматривается);
	КонецЕсли;

	Если Отбор.ОтборПринятыНаРаботу Тогда
		ОтборКандидатов.Вставить("Состояние", Перечисления.СостоянияСогласования.Согласовано);
		Если Отбор.ОтборПериодОдобрения <> ВидыОтбораПериода().Все Тогда
			ОтборКандидатов.Вставить("ДатаРешения", ДатыПериода(Отбор.ОтборПериодОдобрения, ТекущаяДатаСеанса()));
		КонецЕсли;
	КонецЕсли;
	
	Если Отбор.ОтборТекущийЭтапИспользование Тогда
		ОтборКандидатов.Вставить("ТекущиеЭтапыРаботыСКандидатами.ЭтапРаботы", Отбор.ОтборТекущийЭтапЗначение);
	КонецЕсли;

	Кандидаты = Справочники.Кандидаты.КандидатыПоОтбору(ОтборКандидатов);
	ОтобратьКандидатовПоДатеАктуальности(Кандидаты, Отбор);
	ОтобратьКандидатовПоПройденномуЭтапу(Кандидаты, Отбор);
	
	Возврат Кандидаты;

КонецФункции

Процедура ОтобратьКандидатовПоДатеАктуальности(Кандидаты, Отбор)
	
	Если Не Отбор.ОтборВРаботе Или Отбор.ОтборПериодВРаботе = ВидыОтбораПериода().Все Тогда
		Возврат;
	КонецЕсли;
	
	ПериодОтбора = ДатыПериода(Отбор.ОтборПериодВРаботе, ТекущаяДатаСеанса());
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Кандидаты", Кандидаты);
	Запрос.УстановитьПараметр("Начало", ПериодОтбора.ДатаНачала);
	Запрос.УстановитьПараметр("Окончание", ПериодОтбора.ДатаОкончания);
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ДатыАктуальности.Кандидат
		|ИЗ
		|	(ВЫБРАТЬ
		|		Кандидаты.Ссылка КАК Кандидат,
		|		Кандидаты.ДатаРегистрации КАК ДатаАктуальности
		|	ИЗ
		|		Справочник.Кандидаты КАК Кандидаты
		|	ГДЕ
		|		Кандидаты.Ссылка В (&Кандидаты)
		|		И ДатаРегистрации МЕЖДУ &Начало И &Окончание
		|
		|	ОБЪЕДИНИТЬ ВСЕ
		|
		|	ВЫБРАТЬ
		|		РаботаСКандидатамиСрез.Кандидат,
		|		РаботаСКандидатамиСрез.Период
		|	ИЗ
		|		РегистрСведений.РаботаСКандидатами.СрезПоследних(&Окончание, Кандидат В (&Кандидаты)) КАК РаботаСКандидатамиСрез
		|	ГДЕ
		|		Период МЕЖДУ &Начало И &Окончание) КАК ДатыАктуальности";

	Кандидаты = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Кандидат");
	
КонецПроцедуры

Процедура ОтобратьКандидатовПоПройденномуЭтапу(Кандидаты, Отбор)
	
	Если Не Отбор.ОтборПройденныйЭтапИспользование Тогда
		Возврат;
	КонецЕсли;
	
	ПериодОтбора = ДатыПериода(Отбор.ОтборПериодЭтапа, ТекущаяДатаСеанса());
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Кандидаты", Кандидаты);
	Запрос.УстановитьПараметр("ЭтапРаботы", Отбор.ОтборПройденныйЭтапЗначение);
	Запрос.УстановитьПараметр("Начало", ПериодОтбора.ДатаНачала);
	Запрос.УстановитьПараметр("Окончание", ПериодОтбора.ДатаОкончания);
	Запрос.УстановитьПараметр("СостояниеЭтапа", Перечисления.СостоянияЭтаповРаботыСКандидатами.Пройден);
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	РаботаСКандидатами.Кандидат
		|ИЗ
		|	РегистрСведений.РаботаСКандидатами КАК РаботаСКандидатами
		|ГДЕ
		|	РаботаСКандидатами.Кандидат В (&Кандидаты)
		|	И РаботаСКандидатами.Период МЕЖДУ &Начало И &Окончание
		|	И РаботаСКандидатами.ЭтапРаботы = &ЭтапРаботы
		|	И РаботаСКандидатами.СостояниеЭтапа = &СостояниеЭтапа";

	Кандидаты = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Кандидат");
	
КонецПроцедуры

Функция ЛичныеДанныеКандидатов(Кандидаты)

	ДанныеКандидатов = Справочники.Кандидаты.ДанныеКандидатов(Кандидаты);
	ДанныеКандидатов.Свернуть("ЛичныеДанныеКандидата");
	Возврат ДанныеКандидатов.ВыгрузитьКолонку("ЛичныеДанныеКандидата");
	
КонецФункции

#КонецОбласти

Функция ИмяКолонки(Префикс, Номер)
	Возврат СравнениеХарактеристикКандидатовКлиентСервер.ИмяКолонки(Префикс, Номер);
КонецФункции

Функция ГруппаОбщихКолонок() Экспорт
	ГруппаКолонок = Новый Массив;
	ГруппаКолонок.Добавить(ОписаниеКолонки("Характеристика", Новый ОписаниеТипов("ПланВидовХарактеристикСсылка.ХарактеристикиПерсонала")));
	ГруппаКолонок.Добавить(ОписаниеКолонки("ЗначенияПредставление", Новый ОписаниеТипов("Строка")));
	ГруппаКолонок.Добавить(ОписаниеКолонки("ОсновноеЗначение", Метаданные.ПланыВидовХарактеристик.ХарактеристикиПерсонала.Тип));
	ГруппаКолонок.Добавить(ОписаниеКолонки("СовпадаетОценка", Новый ОписаниеТипов("Булево")));
	Возврат ГруппаКолонок;
КонецФункции

Функция ГруппаКолонокНаКандидата() Экспорт
	ГруппаКолонок = Новый Массив;
	ГруппаКолонок.Добавить(ОписаниеКолонки("Значение", Метаданные.ПланыВидовХарактеристик.ХарактеристикиПерсонала.Тип));
	ГруппаКолонок.Добавить(ОписаниеКолонки("Оценка", ОбщегоНазначения.ОписаниеТипаЧисло(15, 2)));
	Возврат ГруппаКолонок;
КонецФункции

Функция ОписаниеКолонки(Имя, Тип)
	
	Описание = Новый Структура();
	Описание.Вставить("Имя", Имя);
	Описание.Вставить("Тип", Тип);
	Возврат Описание;
	
КонецФункции

Функция ВидыОтбораПериода()
	Возврат СравнениеХарактеристикКандидатовКлиентСервер.ВидыОтбораПериода();
КонецФункции

Функция ДатыПериода(ВидОтбора, ТекущаяДата)
	
	ДатыПериода = Новый СтандартныйПериод();
	
	Если ВидОтбора = ВидыОтбораПериода().Неделя Тогда
		ДатыПериода.ДатаНачала = ДобавитьДней(ТекущаяДата, -7);
	ИначеЕсли ВидОтбора = ВидыОтбораПериода().Месяц Тогда
		ДатыПериода.ДатаНачала = ДобавитьМесяц(ТекущаяДата, -1);
	ИначеЕсли ВидОтбора = ВидыОтбораПериода().ТриМесяца Тогда
		ДатыПериода.ДатаНачала = ДобавитьМесяц(ТекущаяДата, -3);
	ИначеЕсли ВидОтбора = ВидыОтбораПериода().Полгода Тогда
		ДатыПериода.ДатаНачала = ДобавитьМесяц(ТекущаяДата, -6);
	ИначеЕсли ВидОтбора = ВидыОтбораПериода().Год Тогда
		ДатыПериода.ДатаНачала = ДобавитьМесяц(ТекущаяДата, -12);
	КонецЕсли;

	ДатыПериода.ДатаОкончания = КонецДня(ТекущаяДата);

	Возврат ДатыПериода;
	
КонецФункции

Функция ДобавитьДней(Дата, Дней)
	Возврат НачалоДня(Дата) + Дней * ЗарплатаКадрыКлиентСервер.ДлительностьСутокВСекундах();
КонецФункции

Функция НайтиСтрокуТаблицы(Таблица, Значение, ИмяКолонки)
	
	НайденныеСтроки = Таблица.НайтиСтроки(Новый Структура(ИмяКолонки, Значение));

	Если НайденныеСтроки.Количество() > 0 Тогда
		Возврат НайденныеСтроки[0];
	КонецЕсли;

	Возврат Неопределено;
	
КонецФункции

#Область НомераКолонок

Функция НоваяТаблицаНомераКолонок()
	
	Таблица = Новый ТаблицаЗначений();
	Таблица.Колонки.Добавить("ЛичныеДанныеКандидата", Новый ОписаниеТипов("СправочникСсылка.ЛичныеДанныеКандидатов"));
	Таблица.Колонки.Добавить("Номер", ОбщегоНазначения.ОписаниеТипаЧисло(10, 0, ДопустимыйЗнак.Неотрицательный));
	Таблица.Колонки.Добавить("Кандидат", Новый ОписаниеТипов("СправочникСсылка.Кандидаты"));
	Таблица.Колонки.Добавить("КандидатСостояние", Новый ОписаниеТипов("ПеречислениеСсылка.СостоянияСогласования"));
	Возврат Таблица;
	
КонецФункции

Функция НомерКолонкиЛичныеДанныеКандидата(НомераКолонок, ЛичныеДанныеКандидата)
	Возврат СравнениеХарактеристикКандидатовКлиентСервер.НомерКолонкиЛичныеДанныеКандидата(НомераКолонок,
		ЛичныеДанныеКандидата);
КонецФункции

Функция ДобавитьНомерКолонки(НомераКолонок, ЛичныеДанныеКандидата, Номер)
	НоваяСтрока = НомераКолонок.Добавить();
	НоваяСтрока.ЛичныеДанныеКандидата = ЛичныеДанныеКандидата;
	НоваяСтрока.Номер = Номер;
	Возврат НоваяСтрока;
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли
